# Таблица замены букв
transformation = {
    'а': 'ь', 'б': 'э', 'в': 'ю', 'г': 'я', 'д': 'а', 'е': 'б', 'ё': 'в',
    'ж': 'г', 'з': 'е', 'и': 'ё', 'й': 'ж', 'к': 'з', 'л': 'й', 'м': 'л',
    'н': 'м', 'о': 'н', 'п': 'о', 'р': 'п', 'с': 'р', 'т': 'с', 'у': 'т',
    'ф': 'ф', 'х': 'х', 'ц': 'ц', 'ч': 'ч', 'ш': 'у', 'щ': 'д', 'ъ': 'и',
    'ы': 'к', 'ь': 'ш', 'э': 'щ', 'ю': 'ъ', 'я': 'ы'
}


def transform_text(text):
    # Преобразование текста
    return ''.join(transformation.get(char, char) for char in text.lower())


# Пример использования
input_text = "Это будет коротенькое письмо, но я просто хочу, чтобы у тебя осталось что-то от меня в письменном виде. Хочу написать всё, что думаю. Хочу написать всё, что чувствую. Мне очень нравится то, как в последнее время мы всё больше и больше находим общий \"коннект\", как оба находим общие интересы, особенно нравятся наши посиделки у тебя, когда мы занимаемся чем-то новеньким, смотря фильмец. А ещё скажу о том, что ты самая лучшая, кто бы что бы не говорил. С каждым разом я всё больше и больше очаровываюсь твоей красотой, а так же душевной добротой и твоими ценностями. Это именно то, что зацепило меня тогда и та изюминка в тебе, которой я восхищаюсь по сей день. Я рад, что ты моя девушка. Я благодарен тебе за каждый проведённый день вместе. И я уверен в том, что хочу видеть тебя в своём 2025. Люблю тебя! "
output_text = transform_text(input_text)
print("--------------------------------------------------------------------------------")
print("Исходный текст:", input_text)
print("--------------------------------------------------------------------------------")
print("Преобразованный текст:", output_text)
print("--------------------------------------------------------------------------------")
